# Core
brew "coreutils"

# Binaries
brew "wget"
brew "grep"
brew "curl"
brew "svn"
brew "jq"
brew "ffmpeg"

# Shell
brew "bash"
brew "zsh"
brew "tmux"
brew "tree"

# Editors
brew "vim"
brew "neovim"

# Development
brew "git"
brew "php"
brew "composer"
brew "node"
brew "tree-sitter"

# Security
brew "gnupg"

# CLIs
brew "awscli"           # AWS cli

# Terminal emulators
cask "wezterm"

# Apps
cask "raycast"          # Raycast
cask "the-unarchiver"   # Opens RAR and other archives

# Fonts
cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"
