# Core
brew "coreutils"

# Binaries
brew "wget"
brew "grep"
brew "curl"
brew "svn"
brew "jq"
brew "ffmpeg"
brew "bat"            # cat with syntax highlighting
brew "tree"          # directory tree viewer
brew "tmux"          # terminal multiplexer
brew "btop"          # resource monitor; themed via btop/ (SentryCore)
brew "fzf"           # fuzzy finder (shell Ctrl-R history / Ctrl-T files)
brew "ripgrep"       # fast recursive search; powers telescope live_grep

# Editors
brew "neovim"
brew "tree-sitter-cli"   # compiles nvim-treesitter (main branch) parsers

# Development
brew "php"
brew "composer"
brew "node"
brew "pnpm"
brew "uv"            # Python package/project manager

# Containers
cask "docker-desktop"   # Docker Desktop: engine, CLI & Compose

# Cloud
brew "awscli"
brew "azure-cli"
cask "session-manager-plugin"   # AWS SSM session plugin

# Security
brew "gnupg"
cask "git-credential-manager"

# Terminal emulators
cask "wezterm"

# Apps
cask "raycast"          # Raycast
cask "the-unarchiver"   # Opens RAR and other archives

# Fonts
cask "font-jetbrains-mono-nerd-font"   # terminal + powerlevel10k font
cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"
